
cask "cursor"
cask "lm-studio"
cask "visual-studio-code"
cask "calibre"
cask "dropbox"
cask "zotero"

brew "ack"
brew "xz"
brew "bash"
brew "bash-completion"
brew "bat"
brew "cheat"
brew "colordiff"
brew "duckdb"
brew "eza"
brew "fd"
brew "direnv"
brew "duckdb"
brew "gawk"
brew "gemini-cli"
brew "gh"
brew "glow"
brew "go"
brew "gnupg"
brew "graphviz"
brew "htop"
brew "hub"
brew "just"
brew "knqyf263/pet/pet"
brew "lynx"
brew "mise"
brew "ngrep"
brew "nkf"
brew "pandoc"
brew "ollama"
brew "oven-sh/bun/bun"
brew "pbzip2"
brew "pigz"
brew "pstree"
brew "pv"
brew "pwgen"
brew "pyenv"
brew "pyenv-virtualenv"
brew "pyenv-virtualenvwrapper"
brew "rlwrap"
brew "rsync"
brew "sops"
brew "source-highlight"
brew "ssh-copy-id", link: true
brew "the_silver_searcher"
brew "uv"
brew "w3m"
brew "watch"
brew "wget"
brew "z"
brew "zsh-completions"
brew "zsh-vi-mode"

#
# Dev ext
#
# cask "protege"
# cask "the-unarchiver"
# brew "automake"
# brew "base64"
# brew "genders"
# brew "git-crypt"
# brew "go"
# brew "httpie"
# brew "httping"
# brew "multitail"
# brew "netcat"
# brew "pandoc"
# brew "parallel"
# brew "parquet-cli"
# brew "pip-completion"
# brew "plantuml"
# brew "rename"
