tap 'caskroom/cask'
tap 'homebrew/brewdler'
tap 'motemen/ghq'
# for migemogrep
tap peco/peco
# for packer
tap 'homebrew/binary'
# for scalaXX
tap 'homebrew/version'

brew 'ack'
brew 'ansible'
brew 'base64'
brew 'bash-completion'
brew 'boot2docker'
# brew 'brew-cask'
brew 'cheat'
brew 'cmake'
brew 'colordiff'
brew 'ctags'
brew 'gawk'
brew 'genders'
brew 'gist'
brew 'git'
brew 'graphviz'
brew 'htop-osx'
brew 'httpie'
brew 'ipcalc'
brew 'jq'
brew 'jenkins'
brew 'lynx'
brew 'maven'
brew 'migemogrep'
brew 'mysql'
brew 'netcat'
brew 'ngrep'
brew 'nkf'
brew 'packer'
brew 'parallel'
brew 'pbzip2'
brew 'pdsh', args: ['with-genders', 'without-dshgroups']
brew 'pigz'
brew 'plantuml'
brew 'pstree'
brew 'pv'
brew 'readline'
brew 'reattach-to-user-namespace'
brew 'rlwrap'
brew 'rpm2cpio'
brew 'source-highlight'
brew 'ssh-copy-id'
brew 'sshfs'
brew 'subversion'
brew 'the_silver_searcher'
brew 'tig'
brew 'tmux'
brew 'toilet'
brew 'tree'
brew 'vnstat'
brew 'w3m'
brew 'watch'
brew 'wget'
brew 'xz'
brew 'z'

# nodejs
brew 'nvm'
# python
brew 'pyenv'
brew 'pyenv-virtualenv'
# java
brew 'ant'
brew 'ivy'
brew 'gradle'
# scala
brew 'sbt'
brew 'scala'
brew 'scala210'
brew 'scala29'
brew 'giter8'
brew 'typesafe-activator'
# clojure
brew 'leiningen'

# go based stuff
brew 'ghq'
brew 'peco'

#
# cask
#
cask 'adobe-reader'
cask 'calibre'
cask 'dropbox'
cask 'evernote'
cask 'google-chrome'
cask 'google-drive'
cask 'slack'
cask 'iterm2'
cask 'java'
cask 'java7'
cask 'kindle'
cask 'karabiner'
# tex
# cask 'mactex'

# the recipe may be broken
# cask 'macvim-kaoriya'
cask 'scala-ide'
cask 'skype'
cask 'the-unarchiver'
cask 'vagrant'
cask 'virtualbox'
# docker
# cask 'boot2docker'
cask 'dockertoolbox'
# utils
cask 'jdiskreport'

